# SetProjection Method (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
AnalyticalModelColumn..::..SetProjection Method
AnalyticalModelColumn Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SetProjection(AnalyticalElementSelector, ElementId, ElementId) | Sets the analytical model projection to a preset value.  (Inherited from AnalyticalModelStick.) |
| SetProjection(AnalyticalElementSelector, ElementId, StickElementProjectionZ) | Sets the analytical model projection to a preset value.  (Inherited from AnalyticalModelStick.) |
| SetProjection(AnalyticalElementSelector, StickElementProjectionY, ElementId) | Sets the analytical model projection to a preset value.  (Inherited from AnalyticalModelStick.) |
| SetProjection(AnalyticalElementSelector, StickElementProjectionY, StickElementProjectionZ) | Sets the analytical model projection to a preset value.  (Inherited from AnalyticalModelStick.) |

# See Also
AnalyticalModelColumn Class
AnalyticalModelColumn Members
Autodesk.Revit.DB.Structure Namespace